<template>
    <div @wheel="onwheel" class="bg-black" ref="seasonSliderRoot">
        <div class="page-content">
            <div class="container-fluid">
                <left-menu class="left-menu--season"/>
                <b-row>
                    <b-col cols="12">
                        <b-navbar variant="faded" toggleable="lg" type="light">
                            <b-navbar-brand @click="pusherTop('/')">
                                <img src="/img/icon/icon-logo-opacity.svg" alt="Klever studio">
                                <img src="/img/icon/icon-studio-w.svg" alt="Klever studio">
                            </b-navbar-brand>

                            <b-navbar-toggle target="nav-collapse"/>

                            <b-collapse id="nav-collapse" is-nav>
                                <b-navbar-nav class="ml-auto">
                                    <b-nav-item-dropdown text="Услуги">
                                        <b-dropdown-item @click="pusherBottom('/services-polygraphy')">
                                            <svg width="21" height="22" viewBox="0 0 21 22" fill="none"
                                                 xmlns="http://www.w3.org/2000/svg">
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M12.3817 12.4978C12.3817 12.7689 16.5501 14.0048 16.5501 16.229C16.5501 17.308 15.6116 17.8925 14.5088 17.8925L13.8324 17.8743C13.5582 17.8625 13.5458 17.8562 13.4119 18.0071C12.9059 18.5917 12.2967 19.2971 11.4009 19.3212C10.7672 19.3394 10.2492 18.9474 10.0298 18.5075C9.82864 18.0976 9.68226 17.2357 9.68226 16.6207C9.56655 16.7053 9.03615 17.525 8.88392 17.7178C8.7558 17.8806 7.97607 18.592 7.97607 18.7126C7.97607 20.0207 9.49938 21.0997 10.8219 21.0997H11.023C11.9006 21.0997 12.7657 20.6175 13.2596 20.2255C13.613 19.9421 13.924 19.5263 14.0335 19.4418C14.5088 19.062 16.2332 19.7433 17.6105 18.3328C18.0555 17.8807 18.6403 17.1032 18.6403 16.2109V16.0844C18.6403 14.728 17.3546 13.4321 16.5501 12.8535C16.0442 12.4919 13.7105 11.045 13.0399 11.045C12.7595 11.0454 12.3817 12.1484 12.3817 12.4978Z"
                                                      fill="#F000FE"/>
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M5.51369 18.9357H5.80608C7.44547 18.9357 8.61542 17.2299 9.27942 16.1751C9.6879 15.5182 10.3764 14.3547 10.5713 13.5591C10.6567 13.2034 10.6261 13.2034 10.3764 13.0588C10.1752 12.9442 9.52948 12.6308 9.24292 12.6308C9.02353 12.6308 7.55498 16.8501 5.64145 16.8501H5.3308C4.55692 16.8501 3.94147 15.9581 3.89876 15.1503C3.88671 14.861 3.89876 14.6922 3.89876 14.4029C3.89876 14.1077 3.99002 13.8785 3.81955 13.7156C3.5757 13.4864 3.23439 13.1793 3.03325 12.9319C2.52147 12.2869 2.18636 11.5273 2.76495 10.6413C2.96609 10.3279 3.32565 10.1409 3.74617 10.0567C3.96556 10.0085 5.03184 9.91802 5.12967 9.8698C5.01979 9.70697 4.24007 9.17065 4.02652 9.01376C3.72792 8.79085 3.32565 8.15179 2.92338 8.15179C2.43605 8.15179 1.75927 8.67031 1.52783 8.95331C0.272468 10.4844 0.564863 12.5277 1.80198 13.7576C1.9907 13.9504 2.17359 14.0951 2.34443 14.318C2.53315 14.5713 2.4846 14.8784 2.4846 15.3005C2.4846 16.0779 2.64303 16.5905 2.89892 17.1149C3.32017 17.9591 4.28899 18.9357 5.51369 18.9357Z"
                                                      fill="#F000FE"/>
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M10.8218 8.52596C10.8218 8.83343 11.8271 9.23734 12.2538 9.23734C12.4977 9.23734 13.8078 5.01799 15.886 5.01799H16.0506C16.6175 5.01799 17.0804 5.5124 17.2997 5.87996C17.6411 6.4708 17.5374 7.20593 17.5374 8.06196C17.5374 8.17657 18.9694 9.09269 18.9694 10.2621C18.9694 10.8949 18.5978 11.4193 18.1773 11.6363C17.775 11.8414 16.9584 12.0039 16.3795 12.0161C16.3977 12.1971 17.5374 12.8963 17.9335 13.2939C18.0189 13.3844 18.3113 13.7519 18.4208 13.7519C18.6646 13.7519 19.152 13.4986 19.3228 13.4022C20.1029 12.9441 20.7183 11.9616 20.7183 10.955V10.6716C20.7183 9.87009 20.3526 9.11643 20.0299 8.62832C19.8349 8.33309 19.64 8.13392 19.3962 7.8869C18.988 7.47112 19.0063 7.65768 19.0063 6.94036C19.0063 5.77092 18.6832 4.78841 18.1594 4.14935C17.6659 3.55257 16.8186 2.91351 15.7586 2.91351C14.3875 2.91351 13.1686 4.16122 12.6021 5.02319C12.2659 5.53651 10.8218 7.90544 10.8218 8.52596Z"
                                                      fill="#F000FE"/>
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M8.32301 10.8224C8.68257 10.8224 9.05418 9.86991 9.05418 9.42409C9.05418 9.31541 7.96929 8.78503 7.80502 8.70083C7.33595 8.46568 6.96397 8.27875 6.54965 7.97758C5.97691 7.5555 4.86756 6.60933 4.86756 5.67504V5.56043C4.86756 5.0842 5.25742 4.60203 5.53777 4.39099C6.50074 3.6618 7.7134 4.17401 7.95104 3.9511C8.49932 3.44482 9.11514 2.55874 9.90107 2.55874H10.1205C10.748 2.55874 11.2112 2.95672 11.4368 3.39067C11.6197 3.74043 11.7536 4.70477 11.7536 5.24739C11.8694 5.16283 12.4604 4.30716 12.6005 4.12616C12.8199 3.83093 13.4416 3.41478 13.4416 3.00494C13.4416 2.64331 13.0455 2.02242 12.8688 1.79951C12.6191 1.49204 12.2472 1.20867 11.8573 1.03991C10.8885 0.611895 9.83427 0.744677 8.98117 1.17863C8.43289 1.462 7.89665 1.87777 7.48196 2.34214C7.21987 2.63737 7.26878 2.5109 6.81759 2.52314C5.61698 2.54725 4.78214 2.81244 4.08127 3.34282C3.44756 3.82499 2.89891 4.59053 2.8321 5.6513C2.71639 7.44756 4.55655 8.91818 5.88529 9.69595C6.24521 9.90032 7.92694 10.8224 8.32301 10.8224Z"
                                                      fill="#F000FE"/>
                                            </svg>
                                            <span>
                                                Производство полиграфии
                                           </span>
                                        </b-dropdown-item>
                                        <b-dropdown-item @click="pusherBottom('/services-souvenirs')">
                                            <svg width="21" height="21" viewBox="0 0 21 21" fill="none"
                                                 xmlns="http://www.w3.org/2000/svg">
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M12.3817 11.8193C12.3817 12.0905 16.5501 13.3263 16.5501 15.5506C16.5501 16.6295 15.6116 17.2141 14.5088 17.2141L13.8324 17.1959C13.5582 17.184 13.5458 17.1777 13.4119 17.3287C12.9059 17.9132 12.2967 18.6186 11.4009 18.6428C10.7672 18.6609 10.2492 18.2689 10.0298 17.829C9.82864 17.4192 9.68226 16.5572 9.68226 15.9422C9.56655 16.0268 9.03615 16.8465 8.88392 17.0394C8.7558 17.2022 7.97607 17.9136 7.97607 18.0341C7.97607 19.3423 9.49938 20.4212 10.8219 20.4212H11.023C11.9006 20.4212 12.7657 19.939 13.2596 19.547C13.613 19.2636 13.924 18.8479 14.0335 18.7633C14.5088 18.3835 16.2332 19.0648 17.6105 17.6543C18.0555 17.2022 18.6403 16.4248 18.6403 15.5324V15.4059C18.6403 14.0495 17.3546 12.7536 16.5501 12.175C16.0442 11.8134 13.7105 10.3665 13.0399 10.3665C12.7595 10.3669 12.3817 11.4699 12.3817 11.8193Z"
                                                      fill="#484848"/>
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M5.51369 18.2572H5.80608C7.44547 18.2572 8.61542 16.5515 9.27942 15.4966C9.6879 14.8398 10.3764 13.6762 10.5713 12.8807C10.6567 12.525 10.6261 12.525 10.3764 12.3803C10.1752 12.2657 9.52948 11.9523 9.24292 11.9523C9.02353 11.9523 7.55498 16.1716 5.64145 16.1716H5.3308C4.55692 16.1716 3.94147 15.2796 3.89876 14.4718C3.88671 14.1825 3.89876 14.0138 3.89876 13.7245C3.89876 13.4292 3.99002 13.2 3.81955 13.0372C3.5757 12.808 3.23439 12.5009 3.03325 12.2535C2.52147 11.6085 2.18636 10.8489 2.76495 9.9628C2.96609 9.64939 3.32565 9.46246 3.74617 9.37826C3.96556 9.33005 5.03184 9.23955 5.12967 9.19133C5.01979 9.02851 4.24007 8.49219 4.02652 8.3353C3.72792 8.11239 3.32565 7.47333 2.92338 7.47333C2.43605 7.47333 1.75927 7.99184 1.52783 8.27484C0.272468 9.80591 0.564863 11.8492 1.80198 13.0791C1.9907 13.272 2.17359 13.4166 2.34443 13.6395C2.53315 13.8928 2.4846 14.2 2.4846 14.622C2.4846 15.3994 2.64303 15.912 2.89892 16.4365C3.32017 17.2806 4.28899 18.2572 5.51369 18.2572Z"
                                                      fill="#484848"/>
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M10.8218 7.84749C10.8218 8.15496 11.8271 8.55887 12.2538 8.55887C12.4977 8.55887 13.8078 4.33953 15.886 4.33953H16.0506C16.6175 4.33953 17.0804 4.83394 17.2997 5.2015C17.6411 5.79234 17.5374 6.52746 17.5374 7.38349C17.5374 7.4981 18.9694 8.41422 18.9694 9.58367C18.9694 10.2164 18.5978 10.7409 18.1773 10.9578C17.775 11.163 16.9584 11.3254 16.3795 11.3376C16.3977 11.5186 17.5374 12.2178 17.9335 12.6154C18.0189 12.7059 18.3113 13.0735 18.4208 13.0735C18.6646 13.0735 19.152 12.8201 19.3228 12.7237C20.1029 12.2656 20.7183 11.2831 20.7183 10.2765V9.99314C20.7183 9.19163 20.3526 8.43796 20.0299 7.94986C19.8349 7.65462 19.64 7.45545 19.3962 7.20843C18.988 6.79265 19.0063 6.97921 19.0063 6.2619C19.0063 5.09245 18.6832 4.10994 18.1594 3.47088C17.6659 2.87411 16.8186 2.23505 15.7586 2.23505C14.3875 2.23505 13.1686 3.48275 12.6021 4.34472C12.2659 4.85804 10.8218 7.22697 10.8218 7.84749Z"
                                                      fill="#484848"/>
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M8.32301 10.1439C8.68257 10.1439 9.05418 9.19144 9.05418 8.74562C9.05418 8.63695 7.96929 8.10656 7.80502 8.02237C7.33595 7.78722 6.96397 7.60028 6.54965 7.29911C5.97691 6.87703 4.86756 5.93087 4.86756 4.99657V4.88196C4.86756 4.40573 5.25742 3.92356 5.53777 3.71252C6.50074 2.98333 7.7134 3.49554 7.95104 3.27263C8.49932 2.76635 9.11514 1.88028 9.90107 1.88028H10.1205C10.748 1.88028 11.2112 2.27825 11.4368 2.7122C11.6197 3.06196 11.7536 4.0263 11.7536 4.56892C11.8694 4.48436 12.4604 3.6287 12.6005 3.4477C12.8199 3.15246 13.4416 2.73631 13.4416 2.32647C13.4416 1.96484 13.0455 1.34396 12.8688 1.12105C12.6191 0.813571 12.2472 0.530204 11.8573 0.361445C10.8885 -0.0665721 9.83427 0.0662097 8.98117 0.500162C8.43289 0.783529 7.89665 1.19931 7.48196 1.66367C7.21987 1.95891 7.26878 1.83243 6.81759 1.84467C5.61698 1.86878 4.78214 2.13397 4.08127 2.66436C3.44756 3.14653 2.89891 3.91206 2.8321 4.97283C2.71639 6.7691 4.55655 8.23971 5.88529 9.01749C6.24521 9.22185 7.92694 10.1439 8.32301 10.1439Z"
                                                      fill="#90FE00"/>
                                            </svg>
                                            <span>
                                                Сувенирная продукция
                                            </span>
                                        </b-dropdown-item>
                                        <b-dropdown-item @click="pusherBottom('/advertising-constructions')">
                                            <svg width="21" height="21" viewBox="0 0 21 21" fill="none"
                                                 xmlns="http://www.w3.org/2000/svg">
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M12.3817 12.1409C12.3817 12.412 16.5501 13.6478 16.5501 15.8721C16.5501 16.951 15.6116 17.5356 14.5088 17.5356L13.8324 17.5174C13.5582 17.5055 13.5458 17.4992 13.4119 17.6502C12.9059 18.2347 12.2967 18.9402 11.4009 18.9643C10.7672 18.9825 10.2492 18.5904 10.0298 18.1505C9.82864 17.7407 9.68226 16.8787 9.68226 16.2638C9.56655 16.3483 9.03615 17.168 8.88392 17.3609C8.7558 17.5237 7.97607 18.2351 7.97607 18.3556C7.97607 19.6638 9.49938 20.7427 10.8219 20.7427H11.023C11.9006 20.7427 12.7657 20.2606 13.2596 19.8685C13.613 19.5852 13.924 19.1694 14.0335 19.0848C14.5088 18.705 16.2332 19.3864 17.6105 17.9758C18.0555 17.5237 18.6403 16.7463 18.6403 15.8539V15.7275C18.6403 14.3711 17.3546 13.0752 16.5501 12.4966C16.0442 12.1349 13.7105 10.688 13.0399 10.688C12.7595 10.6884 12.3817 11.7915 12.3817 12.1409Z"
                                                      fill="#484848"/>
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M5.51369 18.5787H5.80608C7.44547 18.5787 8.61542 16.873 9.27942 15.8181C9.6879 15.1613 10.3764 13.9978 10.5713 13.2022C10.6567 12.8465 10.6261 12.8465 10.3764 12.7019C10.1752 12.5872 9.52948 12.2738 9.24292 12.2738C9.02353 12.2738 7.55498 16.4932 5.64145 16.4932H5.3308C4.55692 16.4932 3.94147 15.6012 3.89876 14.7934C3.88671 14.5041 3.89876 14.3353 3.89876 14.046C3.89876 13.7508 3.99002 13.5215 3.81955 13.3587C3.5757 13.1295 3.23439 12.8224 3.03325 12.575C2.52147 11.93 2.18636 11.1704 2.76495 10.2843C2.96609 9.97093 3.32565 9.78399 3.74617 9.6998C3.96556 9.65158 5.03184 9.56108 5.12967 9.51286C5.01979 9.35004 4.24007 8.81372 4.02652 8.65683C3.72792 8.43392 3.32565 7.79486 2.92338 7.79486C2.43605 7.79486 1.75927 8.31338 1.52783 8.59637C0.272468 10.1274 0.564863 12.1707 1.80198 13.4006C1.9907 13.5935 2.17359 13.7381 2.34443 13.9611C2.53315 14.2144 2.4846 14.5215 2.4846 14.9436C2.4846 15.721 2.64303 16.2336 2.89892 16.758C3.32017 17.6022 4.28899 18.5787 5.51369 18.5787Z"
                                                      fill="#484848"/>
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M10.8218 8.16902C10.8218 8.4765 11.8271 8.88041 12.2538 8.88041C12.4977 8.88041 13.8078 4.66106 15.886 4.66106H16.0506C16.6175 4.66106 17.0804 5.15547 17.2997 5.52303C17.6411 6.11387 17.5374 6.84899 17.5374 7.70503C17.5374 7.81964 18.9694 8.73576 18.9694 9.9052C18.9694 10.538 18.5978 11.0624 18.1773 11.2794C17.775 11.4845 16.9584 11.6469 16.3795 11.6592C16.3977 11.8402 17.5374 12.5393 17.9335 12.9369C18.0189 13.0274 18.3113 13.395 18.4208 13.395C18.6646 13.395 19.152 13.1417 19.3228 13.0452C20.1029 12.5872 20.7183 11.6047 20.7183 10.598V10.3147C20.7183 9.51316 20.3526 8.75949 20.0299 8.27139C19.8349 7.97616 19.64 7.77698 19.3962 7.52996C18.988 7.11419 19.0063 7.30075 19.0063 6.58343C19.0063 5.41398 18.6832 4.43147 18.1594 3.79241C17.6659 3.19564 16.8186 2.55658 15.7586 2.55658C14.3875 2.55658 13.1686 3.80428 12.6021 4.66625C12.2659 5.17958 10.8218 7.54851 10.8218 8.16902Z"
                                                      fill="#010BFF"/>
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M8.32301 10.4654C8.68257 10.4654 9.05418 9.51297 9.05418 9.06715C9.05418 8.95848 7.96929 8.42809 7.80502 8.3439C7.33595 8.10875 6.96397 7.92182 6.54965 7.62065C5.97691 7.19856 4.86756 6.2524 4.86756 5.3181V5.2035C4.86756 4.72726 5.25742 4.24509 5.53777 4.03405C6.50074 3.30486 7.7134 3.81708 7.95104 3.59417C8.49932 3.08789 9.11514 2.20181 9.90107 2.20181H10.1205C10.748 2.20181 11.2112 2.59978 11.4368 3.03374C11.6197 3.38349 11.7536 4.34783 11.7536 4.89046C11.8694 4.80589 12.4604 3.95023 12.6005 3.76923C12.8199 3.47399 13.4416 3.05785 13.4416 2.648C13.4416 2.28638 13.0455 1.66549 12.8688 1.44258C12.6191 1.1351 12.2472 0.851738 11.8573 0.682979C10.8885 0.254961 9.83427 0.387743 8.98117 0.821695C8.43289 1.10506 7.89665 1.52084 7.48196 1.98521C7.21987 2.28044 7.26878 2.15396 6.81759 2.1662C5.61698 2.19031 4.78214 2.45551 4.08127 2.98589C3.44756 3.46806 2.89891 4.2336 2.8321 5.29437C2.71639 7.09063 4.55655 8.56125 5.88529 9.33902C6.24521 9.54339 7.92694 10.4654 8.32301 10.4654Z"
                                                      fill="#484848"/>
                                            </svg>
                                            <span>
                                                Рекламные конструкции
                                            </span>
                                        </b-dropdown-item>
                                    </b-nav-item-dropdown>
                                    <b-nav-item @click="pusherTop('/about')">Агентство</b-nav-item>
                                    <b-nav-item @click="pusherTop('/portfolio')">Клиенты</b-nav-item>
                                    <b-nav-item @click="pusherTop('/contacts')">Контакты</b-nav-item>
                                    <b-nav-item @click="pusherTop('/blog')">Блог</b-nav-item>
                                </b-navbar-nav>
                                <b-navbar-nav>
                                    <b-nav-item v-b-modal.feedback>Обратная связь</b-nav-item>
                                </b-navbar-nav>
                            </b-collapse>
                        </b-navbar>
                    </b-col>
                </b-row>
                <div id="pinContainer">
                    <div class="static-block" :style="'z-index:' + (slides.length + 1)">
                        <section v-for="(slide, index) in slides" :key="'1' + slide.title"
                                 :ref="'slideVertical' + (slides.length === (index + 1) ? '_last' : '')"
                                 class="panel vertical"
                                 :style="'z-index:' + ((slides.length * 2 +1) - index)"
                        >
                            <div class='title' ref="slideTitle">
                                <h1>{{ slide.title }}</h1>
                                <div class="btn-group">
                                    <a :href="slide.href" target="_blank" referrerpolicy="no-referrer"
                                       class="d-flex flex-wrap flex-md-nowrap">
                                        <div class="circle circle-80 circle-green">
                                            <svg width="21" height="16" class="m-auto" viewBox="0 0 21 16" fill="none"
                                                 xmlns="http://www.w3.org/2000/svg">
                                                <path d="M20.4039 8.8741C20.7944 8.48357 20.7944 7.85041 20.4039 7.45989L14.0399 1.09592C13.6494 0.7054 13.0162 0.7054 12.6257 1.09592C12.2352 1.48645 12.2352 2.11961 12.6257 2.51014L18.2826 8.16699L12.6257 13.8238C12.2352 14.2144 12.2352 14.8475 12.6257 15.2381C13.0162 15.6286 13.6494 15.6286 14.0399 15.2381L20.4039 8.8741ZM0.302734 9.16699H19.6968V7.16699H0.302734V9.16699Z"
                                                      fill="#161A25"/>
                                            </svg>
                                        </div>
                                        <div class="text my-auto">
                                            подробно
                                        </div>
                                    </a>
                                </div>
                            </div>
                        </section>
                    </div>
                    <section v-for="(slide, index) in slides" :key="'2' + slide.title"
                             class="panel horizontal"
                             :ref="'slideHorisontal' + (slides.length === (index + 1) ? '_last' : '')"
                             :style="'z-index:' + (slides.length - index) + '; ' + (slides.length === (index + 1) ? 'left:55vw;right:auto;' : '')">
                        <img :src="slide.img"/>
                    </section>
                </div>
            </div>
            <main-footer/>
        </div>
    </div>
</template>
<script>
    import {TweenMax, TimelineMax, Linear, Power4} from 'gsap'

    export default {
        name: 'sectionScroll',
        data() {
            return {
                isFirst: true,
                slides: [
                    {
                        title: 'Интенсивным развитием, трудно недооценить',
                        img: '/img/bg.png',
                        href: 'https://klever-print.ru/'
                    },
                    {
                        title: 'Cтудия производства рекламы',
                        img: '/img/bg-2.png',
                        href: 'https://klever-print.ru/'
                    },
                    {
                        title: 'Сувенирная продукция живет сегодня здесь и сейчас',
                        img: '/img/bg-3.png',
                        href: 'https://klever-print.ru/'
                    },
                ],
                scene: null,
            }
        },
        components: {
            leftMenu: () => import(/* webpackChunkName: "left-menu" */'./leftMenu'),
            mainFooter: () => import(/* webpackChunkName: "main-footer" */'./mainFooter'),
        },
        mounted() {
            this.$nextTick(this.pinContainerScene);
        },
        methods: {
            pinContainerScene() {
                const timeline = new TimelineMax();

                this.$refs.slideVertical.map((value, index) => {
                    let arrayOfAnimations = [
                        TweenMax.fromTo(value, 1,
                            {
                                y: '0%'
                            },
                            {
                                y: '-100%',
                                ease: Linear.easeNone
                            }
                        ),
                        TweenMax.fromTo(this.$refs.slideHorisontal[index], 1,
                            {
                                x: '100%'
                            },
                            {
                                x: '0%',
                                ease: Linear.easeNone
                            }
                        )
                    ];

                    if (value.nextElementSibling !== null && typeof value.nextElementSibling.firstElementChild !== 'undefined') {
                        arrayOfAnimations.push(TweenMax.fromTo(value.nextElementSibling.firstElementChild, 1,
                            {
                                x: '-200%',
                                y: '200%'
                            },
                            {
                                x: '0%',
                                y: '0%',
                                ease: Power4.easeIn,
                            }
                        ));
                    }

                    timeline.add(arrayOfAnimations);
                });

                this.scene = this.$scrollmagic
                    .scene({
                        triggerElement: '#pinContainer',
                        triggerHook: '0',
                        duration: (this.$refs.slideVertical.length * 100) + '%',
                    })
                    .setPin('#pinContainer')
                    .setTween(timeline)
                ;


                this.$scrollmagic.addScene(this.scene)
            },
            onwheel(ev) {
                if (this.scene.progress() !== 0) {
                    return;
                } else if (this.windowWidth <= this.mobileSizeBreakpoint) {
                    return;
                } else {
                    if (ev.deltaY < 0) {
                        if (typeof this.$refs.seasonSliderRoot !== 'undefined') {
                            this.$refs.seasonSliderRoot.style.height = '100vh';
                        }

                        this.$root.$emit('change-animation-direction', {
                            direction: 'top',
                        });

                        if (this.$route.name !== 'main') {
                            this.$router.push('/');
                        }
                    }
                }
            },
            pusherTop(path) {
                this.$root.$emit('change-animation-direction', {
                    direction: 'top',
                });
                this.$router.push(path);
            },
            pusherBottom(path) {
                this.$root.$emit('change-animation-direction', {
                    direction: 'bottom',
                });
                this.$router.push(path);
            }
        },

    }
</script>


<style scoped lang='scss'>
    @import "/src/scss/style.scss";

    html {
        .page-content {
            background: black;

            .navbar {
                padding: 37px 118px 70px 55px;
                position: fixed;
                background: transparent;
                width: 100%;
                z-index: 10;
                left: 0;
                top: 0;
            }

            .footer {
                background: black;
                margin: 0 118px 0 50px;
            }
        }

        #pinContainer {
            background: black;
            position: relative;
            margin: auto;
            top: 0;
            left: 0;
            bottom: auto;
            right: auto;
            box-sizing: border-box;
            width: 100vw;
            height: 100vh;
        }


        .static-block {
            width: 47%;
            height: 100vh;
            background: black;
            z-index: 1;
            position: absolute;
            left: 0;
        }

        .panel {
            height: 100vh;
            width: 100%;
            position: absolute;
            display: flex;
            text-align: center;
            justify-content: center;
            align-items: center;
            color: white;
            font-size: 3rem;
            background: black;

            &.vertical,
            &.last {
                z-index: 1;
                width: 100%;
                min-height: 100vh;
                left: 0;
                top: 0;
            }

            &.horizontal,
            &.last {
                z-index: 0;
                width: 53vw;
                right: 53vw;


                .image, img {
                    max-width: 53vw;
                    width: 100%;
                    height: 100%;
                }
            }

            .title {
                height: 70%;
                width: 100%;
                display: flex;
                flex-direction: column;

                h1 {
                    font-family: "Druk Wide Bold", sans-serif;
                    font-size: 60px;
                    line-height: 130%;
                    margin: 60px 0 35px 210px;
                    position: absolute;
                    z-index: 1;
                    text-align: left;
                    width: 120%;
                    left: 0;
                    @include _1170 {
                        margin: 0 auto 100px 140px;
                        @include _600 {
                            max-width: 100%;
                            font-size: 2.2em;
                            margin: 0 auto 100px 70px;
                        }
                    }

                    &:before {
                        content: '';
                        width: 197px;
                        height: 197px;
                        background: url("/img/season-h-bg.png") no-repeat center;
                        background-size: contain;
                        position: absolute;
                        left: -5%;
                        top: -25%;
                        z-index: 0;
                        @include _1170 {
                            left: -5%;
                            @include _767 {
                                width: 150px;
                                height: 150px;
                                @include _600 {
                                    left: 0;
                                }
                            }
                        }
                    }
                }

                .btn-group {
                    margin: auto 0 85px 210px;
                    display: flex;
                    @include _1170 {
                        margin: 0 auto 85px 140px;
                        @include _600 {
                            margin: 0 auto 85px 70px;
                        }
                    }

                    a {
                        margin: auto 50px auto 0;
                        @include _600 {
                            margin: auto 10px auto 0;
                        }

                        & > * {
                            transition: all .3s ease-in-out;
                        }

                        .text {
                            color: $color-white;
                            font-weight: 900;
                            font-size: 10px;
                            line-height: 180%;
                            letter-spacing: 0.2em;
                            text-transform: uppercase;
                            margin: auto 0 auto 20px;
                            @include _767 {
                                margin: auto 0 auto 10px;
                            }
                        }

                        &:hover {
                            .circle-green {
                                background: transparent;
                                border: 1px solid $color-green;

                                svg {
                                    path {
                                        fill: $color-green;
                                    }
                                }
                            }

                            .text {
                                color: $color-green;
                            }
                        }
                    }
                }
            }
        }
    }
</style>